#############################
#
# Задача 1
#
# создать список функцию потом в эту функцию параметром список потом проверяется

# list = [11, 4, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20]
# def somefunc(list):
#     b = 0
#     for i in list:
#         if i <30 and i%3== 0:
#             print(i)
#         else:
#             b += i
#     return b


# print('сумма не удостоверяющих условию', somefunc(list))

##########################

# Задача 2

# sum_range(start, end)
# def somefunc(start, end):
#     if start > end:
#         start, end = end, start
#     return sum(range(start,end +1))


# print(somefunc(10,7))

############
# Задача 3

# def more_than_five(func):
#     int(func.sort(key = lambda x: x % 5))
#     return

##################

# x = input()
# y = ''.join(map(str, x))
# z = int(y)


# def more_than_five(z):
#     if z <= 5 or -z >= 5:
#         return


# print(more_than_five(z))

# Задача не возвращает значения после проверки.

##########################

# Задача 4

#

n = input('Введите целое число ', )
 def odd(0, n):
    for i in range(0, n):
        if i % 2 != 0:
            return

print(a)
